{
  "data": [
    {
      "id": "case1",
      "title": "Cardiac Mapping",
      "sub_title": "Plug Connector and Raw Cable for Cardiac Mapping",
      "video_url": "./src/video/case1.mp4",
      "challenge": "The umbilical cable assembly requires the 78-pin plug connector on both ends, and the cable and connectors must serve as a sturdy bridge for high - definition cardiac mapping capital equipment.",
      "solutions": [
        {
          "text": "Customer has provided physical female connector samples with details. SINBON helps customer to redesign the plug connector and raw cable.",
          "bubble": [
            "./src/assets/bubble-case1.png"
          ],
          "features": [
            {
              "icon": "./src/assets/feature-customized.png",
              "text": "Customized design based on your prototype or sample."
            },
            {
              "icon": "./src/assets/feature-plug.png",
              "text": "Exclusive design pattern with 78 current plug."
            },
            {
              "icon": "./src/assets/feature-solution.png",
              "text": "Provide integrated solution with receptacle panel + umbilical cable + catheter connector."
            }
          ]
        }
      ]
    },
    {
      "id": "case2",
      "title": "X-ray Detector Panel",
      "sub_title": "Adaptor for X-ray Detector Panel",
      "video_url": "./src/video/case2.mp4",
      "challenge": "The original power connector's functionality is limited because the original design can't survive frequent plugging and removing of the panel.",
      "solutions": [
        {
          "text": "SINBON helps customer design an adaptor which can be replaced without disassembling the panel assembly. Moreover, the adapter can be customized with various functions based on the use of environment.",
          "bubble": [
            "/src/assets/bubble-case2-1.png"
          ],
          "features": [
            {
              "icon": "./src/assets/feature-magnetic.png",
              "text": "Magnetic clamping which is easy to install and remove from power transmission modules"
            },
            {
              "icon": "./src/assets/feature-adaptors.png",
              "text": "Customized adaptors to meet different scenarios"
            },
            {
              "icon": "./src/assets/feature-expand.png",
              "text": "Expand product service life"
            },
            {
              "icon": "./src/assets/feature-resource-saving.png",
              "text": "Resource saving which only need to replace the damage part"
            }
          ]
        }
      ]
    },
    {
      "id": "case3",
      "title": "EV Inlet",
      "sub_title": "Electric Vehicle Inlet",
      "video_url": "./src/video/case3.mp4",
      "challenge": "In the highly competitive electric vehicle market, customers usually hope to increase the proportion of automated manufacturing and accelerate production efficiency.",
      "solutions": [
        {
          "text": "SINBON modularized the inlet of EV in order to realize automatic production and improve production process efficiency.\nAnd we still retain the option of customization for customers!\n1. Panel (flange) Customization​\nPanels (flanges) can be tailored to the customer’s vehicle installation environment without changing the central part.\n2. Customized Charging Pedestal Wiring Method The rear inlet module of the charging base can be replaced by a different angle design.",
          "bubble": [
            "./src/assets/bubble-case3-1.png",
            "./src/assets/bubble-case3-2.png"
          ],
          "features": [
            {
              "icon": "./src/assets/feature-time.png",
              "text": "More helpful to shorten the lead time"
            },
            {
              "icon": "./src/assets/feature-maintenance.png",
              "text": "More beneficial to parts maintenance and replacement"
            },
            {
              "icon": "./src/assets/feature-automation.png",
              "text": "More beneficial to the implementation of automation solutions"
            }
          ]
        }
      ]
    },
    {
      "id": "case4",
      "title": "Contact Terminal Design for E-bike",
      "sub_title": "",
      "video_url": "./src/video/case4.mp4",
      "challenge": "Due to the mechanical structure of bike frames, most battery connectors cannot be mated straight up and down but rather in a wiping action as illustrated. Moreover, some e-bike requires high mating cycle count (10,000 cycles minimum) in a mechanically constrained design space to withstand high current interconnection.",
      "solutions": [
        {
          "text": "SINBON offers blade contact terminal design and crown spring terminal design which can meet the mechanical structure of e-bike and also fulfill the mating cycle.\n1. Blade contact connectors are either open face completely or are open one-sided, so mating angles can be absorbed.\n2. The level of current bared is proportional to the contact area in an interconnect system.  Whereas the blade connector would require a lot of space, theory behinds the lamella spring is to curl the blade into a cylinder, so the contact area remains the same but taking less mechanical space.",
          "bubble": [
            "./src/assets/bubble-case4.png"
          ],
          "features": [
            {
              "icon": "./src/assets/feature-customized.png",
              "text": "Customized connector design based on your mechanical structure"
            },
            {
              "icon": "./src/assets/feature-space.png",
              "text": "Reduced mechanical space"
            },
            {
              "icon": "./src/assets/feature-analysis.png",
              "text": "Conduct temperature rise & stress analysis during conceptual phase"
            }
          ]
        }
      ]
    },
    {
      "id": "case5",
      "title": "Robotic Tech Vest",
      "sub_title": "Connector & Raw Cable for Robotic Tech Vest",
      "video_url": "./src/video/case5.mp4",
      "challenge": "In a smart warehouse people and robots sometimes cooperate in the same space. In order to keep maintenance workers safe, a customer needed an electronic system to notify the robots to slow down when a human is nearby. In addition, the system was required to use sound & vibration to alert the human about robot’s presence.",
      "solutions": [
        {
          "text": "**What we did:**\n 1. Customized a lightweight reel for increased flexibility. Weight is reduced by 13%: from 388g to 339g.\n 2. Customized a durable connector. Production capacity is increased from 2K to 40K annually.\n 3. Overmold design of each functional interface link was strengthened. Bending cycle is increased from 10K to 26K, the load is 1.3KG.\n 4. Adjusted test fixtures according to customer requirements.",
          
          "bubble": [
            "./src/assets/bubble-case5.png"
          ],
          "features": [
            {
              "icon": "./src/assets/feature-reduced.png",
              "text": "Reduced size"
            },
            {
              "icon": "./src/assets/feature-reliability.png",
              "text": "Enhanced reliability"
            },
            {
              "icon": "./src/assets/feature-capacity.png",
              "text": "Increased capacity"
            }
          ]
        }
      ]
    },
    {
      "id": "case6",
      "title": "Sewer System",
      "sub_title": "I/O Connector & Raw Cable for Harsh Environment",
      "video_url": "./src/video/case6.mp4",
      "challenge": "Cable assembly is placed in the underground sewer system and must be waterproof, chemical and oil resistant. Harsh environment conditions include:\n-Submerging in the “contaminated” water for 30 days at room temperature\n-Submerging in the heated “contaminated” water at 70°C for 2 days\n-Soaking into Kerosene (lighter fluid) / Motor oil (5W-40) for 7 days",
      "solutions": [
        {
          "text": "1. Reduced lead time from 18-22 to 6 weeks and saved cost by 35%.\n2. Integrated molding design including sealing and dust cap function & provided well waterproof and chemical resistance performance.  \n3. Improved breakout junction method by using PCB board connection instead of wire connection directly to make junction points stronger. Potting the enclosure and then overmolding.\n4. Developed on-line testing jig to reduce testing times.",
          "bubble": [
            "./src/assets/bubble-case6.png"
          ],
          "features": [
            {
              "icon": "./src/assets/feature-time.png",
              "text": "Reduced time"
            },
            {
              "icon": "./src/assets/feature-resource-saving.png",
              "text": "Saved cost"
            },
            {
              "icon": "./src/assets/feature-performance.png",
              "text": "Improved performance"
            }
          ]
        }
      ]
    }
  ]
}